erp3l/src/Documents/СправкаОПодтверждающихДокументах/СправкаОПодтверждающихДокументах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СправкаОПодтверждающихДокументах</name>
  <comment>(-УХ)(*ЕрпМодульОбъекта)(*ЕрпДвижения)</comment>
  <registerRecords>InformationRegister.СведенияВалютногоКонтроляУчетныхДокументов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.ДоговорыКредитовИДепозитов</types>
    </type>
  </attributes>
  <attributes>
    <name>Банк</name>
    <type>
      <types>CatalogRef.КлассификаторБанков</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСправки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.СправкаОПодтверждающихДокументах</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПодтверждающиеДокументы</name>
    <attributes>
      <name>ПодтверждающийДокумент</name>
      <type>
        <types>DocumentRef.ВозвратТоваровПоставщику</types>
        <types>DocumentRef.ОтражениеФактическихДанныхБюджетирования</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодВидаДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДокумента</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаДокумента</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВВалютеДоговора</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаДоговора</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакПоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОжидаемыйСрок</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>CatalogRef.СтраныМира</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакКорректировки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

erp3l/src/AccumulationRegisters/РасчетыСКонтрагентамиПоДокументам/РасчетыСКонтрагентамиПоДокументам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСКонтрагентамиПоДокументам</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьСуммаУпр</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>DefinedType.Договор</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРасчетов</name>
    <type>
      <types>DefinedType.ОбъектРасчетовУХ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРасчетов</name>
    <type>
      <types>DocumentRef.ОтражениеФактическихДанныхБюджетирования</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

erp3l/src/Documents/СправкаОПодтверждающихДокументах/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ТаблицаЗначений") Тогда
		
		ЗаполнитьПоТаблице(ДанныеЗаполнения);
		
	ИначеЕсли ОбщегоНазначения.ВидОбъектаПоТипу(ТипЗнч(ДанныеЗаполнения)) = "Документ" Тогда
		
		ОбщегоНазначения.МенеджерОбъектаПоСсылке(ДанныеЗаполнения).ЗаполнитьПоОснованию(ЭтотОбъект, ДанныеЗаполнения);
		
	КонецЕсли;
	
	ИнициализироватьДокумент(ДанныеЗаполнения);
	
	ЗаполнениеОбъектовПоСтатистике.ЗаполнитьРеквизитыОбъекта(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	
	НастройкиПолей = Документы.СправкаОПодтверждающихДокументах.НастройкиПолейФормы();
	
	ДополнительныеРеквизиты = Новый Структура;
	ДополнительныеРеквизиты.Вставить("ДокументОперацииЗаполнен", Истина);
	
	СвойстваЭлементов = ДенежныеСредстваКлиентСервер.СвойстваЭлементовФормы(ЭтотОбъект, НастройкиПолей,,, ДополнительныеРеквизиты);
	ДенежныеСредстваСервер.ОтключитьПроверкуЗаполненияРеквизитовОбъекта(СвойстваЭлементов, НепроверяемыеРеквизиты);
	ЭтотОбъект.ДополнительныеСвойства.Вставить("СвойстваЭлементов", СвойстваЭлементов);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
	ПодтверждающиеДокументыБезРазбиения = Ложь;
	Если ДополнительныеСвойства.Свойство("ПодтверждающиеДокументыБезРазбиения")
		И ДополнительныеСвойства.ПодтверждающиеДокументыБезРазбиения Тогда
		ПодтверждающиеДокументыБезРазбиения = Истина;
	КонецЕсли;
	
	Если ПодтверждающиеДокументыБезРазбиения Тогда
		ДенежныеСредстваСервер.ПроверитьЗаполнениеРасшифровкиБезРазбиения(
			ЭтотОбъект, ПроверяемыеРеквизиты, "ПодтверждающиеДокументы", "ПодтверждающиеДокументыБезРазбиения", Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если Не ЗначениеЗаполнено(ДатаСправки) Тогда
		ДатаСправки = Дата;
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("СвойстваЭлементов") Тогда
		ДенежныеСредстваСервер.ОчиститьНеиспользуемыеРеквизитыОбъекта(ЭтотОбъект, ЭтотОбъект.ДополнительныеСвойства.СвойстваЭлементов);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Корректировка = Ложь;
	КорректируемаяСправка = Неопределено;
	НомерКорректировки = 0;
	Автор = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	#Область УХ_Встраивание
	// Регистр СведенияВалютногоКонтроляУчетныхДокументов
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СведенияВалютногоКонтроляУчетныхДокументовСрезПоследних.Регистратор КАК СуществующаяСправка,
	|	СведенияВалютногоКонтроляУчетныхДокументовСрезПоследних.ДокументРасчетов КАК ДокументРасчетов
	|ИЗ
	|	Документ.СправкаОПодтверждающихДокументах.ПодтверждающиеДокументы КАК СправкаОПодтверждающихДокументахПодтверждающиеДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияВалютногоКонтроляУчетныхДокументов.СрезПоследних КАК СведенияВалютногоКонтроляУчетныхДокументовСрезПоследних
	|		ПО СправкаОПодтверждающихДокументахПодтверждающиеДокументы.ПодтверждающийДокумент = СведенияВалютногоКонтроляУчетныхДокументовСрезПоследних.ДокументРасчетов
	|			И (НЕ СведенияВалютногоКонтроляУчетныхДокументовСрезПоследних.Регистратор В (&Ссылка, &ДокументОснование))
	|ГДЕ
	|	СправкаОПодтверждающихДокументахПодтверждающиеДокументы.Ссылка = &Ссылка
	|	И СведенияВалютногоКонтроляУчетныхДокументовСрезПоследних.ДокументРасчетов <> Неопределено";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбщегоНазначенияУХ.СообщитьОбОшибке(
		СтрШаблон(
		НСтр("ru = 'Документ %1 указан в СПД %2 В проведении документа отказано.'"), 
		Выборка.ДокументРасчетов, 
		Выборка.СуществующаяСправка),
		Отказ,,
		СтатусСообщения.Важное);
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Движения.СведенияВалютногоКонтроляУчетныхДокументов.Записывать = Истина;
	Для Каждого ТекСтрока Из ПодтверждающиеДокументы Цикл
		Если Не ЗначениеЗаполнено(ТекСтрока.ПодтверждающийДокумент) Тогда
			Возврат;
		КонецЕсли;
		
		НовоеДвижение = Движения.СведенияВалютногоКонтроляУчетныхДокументов.Добавить();
		НовоеДвижение.Период = Дата;
		НовоеДвижение.ДокументРасчетов = ТекСтрока.ПодтверждающийДокумент;
		НовоеДвижение.СрокРепатриации = ТекСтрока.ОжидаемыйСрок;
		НовоеДвижение.СуммаДокументаРасчетов = ТекСтрока.СуммаДокумента;
		
	КонецЦикла;
	
	// Напоминание.
	СоздатьНапоминаниеПроверитьОжидаемыеСрокиСПД();
	#КонецОбласти
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПоТаблице(ТаблицаДокументов)
	
	Если ТаблицаДокументов.Количество() Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ТаблицаДокументов[0]);
		
		Для каждого СтрокаТаблицы Из ТаблицаДокументов Цикл
			ЗаполнитьЗначенияСвойств(ПодтверждающиеДокументы.Добавить(), СтрокаТаблицы);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();
	Автор = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

#КонецОбласти

#Область УХ_Встраивание
// Генерирует напоминание о необходимости проверить ожидаемые сроки 
// в документе Справка о валютных операциях.
Процедура СоздатьНапоминаниеПроверитьОжидаемыеСрокиСПД()
	// Непосредственная отправка напоминаний.
	ВидСобытияПроверитьОжидаемыеСрокиСПД = Справочники.ВидыСобытийОповещений.Напоминание_ПроверитьОжидаемыеСрокиСПД;
	СтруктураНастроек = МодульУправленияОповещениямиУХ.ПолучитьНастройкиОповещенийПоВидуСобытия(ВидСобытияПроверитьОжидаемыеСрокиСПД);
	Если СтруктураНастроек.Количество() > 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&Организация КАК Организация,
		|	&ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	СУММА(РасчетыСКонтрагентамиПоДокументамОстатки.СуммаОстаток) КАК СуммаОстаток,
		|	СправкаОПодтверждающихДокументахПодтверждающиеДокументы.ПодтверждающийДокумент КАК ПодтверждающийДокумент,
		|	СправкаОПодтверждающихДокументахПодтверждающиеДокументы.ОжидаемыйСрок КАК ОжидаемыйСрок,
		|	&Ответственный КАК Ответственный
		|ПОМЕСТИТЬ ВТ_ДанныеРасчетов
		|ИЗ
		|	Документ.СправкаОПодтверждающихДокументах.ПодтверждающиеДокументы КАК СправкаОПодтверждающихДокументахПодтверждающиеДокументы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКонтрагентамиПоДокументам.Остатки(
		|				,
		|				Организация = &Организация
		|					И ДоговорКонтрагента = &ДоговорКонтрагента) КАК РасчетыСКонтрагентамиПоДокументамОстатки
		|		ПО (СправкаОПодтверждающихДокументахПодтверждающиеДокументы.ОжидаемыйСрок <> &ПустаяДата)
		|			И (РасчетыСКонтрагентамиПоДокументамОстатки.ДокументРасчетов = СправкаОПодтверждающихДокументахПодтверждающиеДокументы.ПодтверждающийДокумент)
		|ГДЕ
		|	СправкаОПодтверждающихДокументахПодтверждающиеДокументы.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	СправкаОПодтверждающихДокументахПодтверждающиеДокументы.ПодтверждающийДокумент,
		|	СправкаОПодтверждающихДокументахПодтверждающиеДокументы.ОжидаемыйСрок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ДанныеРасчетов.ОжидаемыйСрок КАК ОжидаемыйСрок,
		|	ВТ_ДанныеРасчетов.Ответственный КАК Ответственный
		|ИЗ
		|	ВТ_ДанныеРасчетов КАК ВТ_ДанныеРасчетов
		|ГДЕ
		|	ВТ_ДанныеРасчетов.СуммаОстаток <> 0";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("ДоговорКонтрагента", Договор);
		Запрос.УстановитьПараметр("Ответственный", Ответственный);
		Запрос.УстановитьПараметр("ПустаяДата", Дата(1, 1, 1));
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ПользовательАдресат = ВыборкаДетальныеЗаписи.Ответственный;
			ДатаФормированияСПД = ВыборкаДетальныеЗаписи.ОжидаемыйСрок;
			СтруктураНапоминание = МодульУправленияОповещениямиУХ.СоздатьСтруктуруНапоминанияПоУмолчанию(СтруктураНастроек, ПользовательАдресат, ДатаФормированияСПД, Ссылка);
			МодульУправленияОповещениямиУХ.ДобавитьНапоминаниеПользователяСЗадачей(СтруктураНапоминание);
		КонецЦикла;
	Иначе
		// Не настроек по данному оповещению. Не отправляем.
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#КонецЕсли
